content/bash/globs.org
* Glob patterns

Globs only work with filenames

** Meta Characters

*
?
[...]
** Extended globs (Similar to regx)

Turn on extended globs with

global patterns with wild card characters
Its how you search for file names

#+begin_src shell

shopt -s extglob

#+end_src

#+begin_src shell :results output

  echo !(*org)

#+end_src



| ?(list) | Matches zero or one pattern      |
| *(list) | Matches zero or more patterns    |
| +(list) | Matches one or more              |
| @(list) | Matches one pattern              |
| !(list) | Matches anything but the pattern |


#+begin_src shell

      rm file[0-9].txt  #removes all files that are file0 - file9

    rm file?.txt   #removes file which are file and a single charecter.txt

    rm file[91] #removes files that are either file9 or file1

    rm file[!1-2] #removes any file that is not 1-2

#+end_src

#+RESULTS:
| #globs.org#   |       |          |
| BashInfo.org  |       |          |
| VariableTypes |       |          |
| file.org      |       |          |
| file1.org     |       |          |
| file1.org~    |       |          |
| globs.org     |       |          |
| globs.org~    |       |          |
| *             | Hello | everyone |


** Reg ex

Can be used for pattern matching

- *Concatenation:* Two reg ex can be written next to each other and and a match willl happen if teh string matches both parts 
- *Union* If eitehr expression matches much like or.
- *Closure* The xpression may be repeated like kleen closure.


ab matches the string ab
a|b matches teh string a or b but not ab
a* matches any number of repeated a from 0 and on


ASCII ordering in grep

** Brace expansion

#+begin_src shell

echo /home/*


#+end_src

#+RESULTS:
: /home/malcolm2

#+begin_src shell

  echo {/home/*,/mnt/*}/.*profile


#+end_src

#+RESULTS:
: /home/malcolm2/.profile /mnt/*/.*profile

#+begin_src shell :results output

    echo {d..a}

  echo {10..0}

#+end_src

#+RESULTS:
: d c b a
: 10 9 8 7 6 5 4 3 2 1 0

