bash/globs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4bca94b">Glob patterns</a>
<ul>
<li><a href="#org615f08c">Meta Characters</a></li>
<li><a href="#org42e73c6">Extended globs (Similar to regx)</a></li>
<li><a href="#org2d4188a">Reg ex</a></li>
<li><a href="#org0563b23">Brace expansion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4bca94b" class="outline-2">
<h2 id="org4bca94b">Glob patterns</h2>
<div class="outline-text-2" id="text-org4bca94b">
<p>
Globs only work with filenames
</p>
</div>

<div id="outline-container-org615f08c" class="outline-3">
<h3 id="org615f08c">Meta Characters</h3>
<div class="outline-text-3" id="text-org615f08c">
<p>
*
?
[&#x2026;]
</p>
</div>
</div>
<div id="outline-container-org42e73c6" class="outline-3">
<h3 id="org42e73c6">Extended globs (Similar to regx)</h3>
<div class="outline-text-3" id="text-org42e73c6">
<p>
Turn on extended globs with
</p>

<p>
global patterns with wild card characters
Its how you search for file names
</p>

<div class="org-src-container">
<pre class="src src-shell">
shopt -s extglob

</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> !(*org)

</pre>
</div>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">?(list)</td>
<td class="org-left">Matches zero or one pattern</td>
</tr>

<tr>
<td class="org-left">*(list)</td>
<td class="org-left">Matches zero or more patterns</td>
</tr>

<tr>
<td class="org-left">+(list)</td>
<td class="org-left">Matches one or more</td>
</tr>

<tr>
<td class="org-left">@(list)</td>
<td class="org-left">Matches one pattern</td>
</tr>

<tr>
<td class="org-left">!(list)</td>
<td class="org-left">Matches anything but the pattern</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-shell">
  rm file[0-9].txt  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">removes all files that are file0 - file9</span>

rm file?.txt   <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">removes file which are file and a single charecter.txt</span>

rm file[91] <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">removes files that are either file9 or file1</span>

rm file[!1-2] <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">removes any file that is not 1-2</span>

</pre>
</div>
</div>
</div>


<div id="outline-container-org2d4188a" class="outline-3">
<h3 id="org2d4188a">Reg ex</h3>
<div class="outline-text-3" id="text-org2d4188a">
<p>
Can be used for pattern matching
</p>

<ul class="org-ul">
<li><b>Concatenation:</b> Two reg ex can be written next to each other and and a match willl happen if teh string matches both parts</li>
<li><b>Union</b> If eitehr expression matches much like or.</li>
<li><b>Closure</b> The xpression may be repeated like kleen closure.</li>
</ul>


<p>
ab matches the string ab
a|b matches teh string a or b but not ab
a* matches any number of repeated a from 0 and on
</p>


<p>
ASCII ordering in grep
</p>
</div>
</div>

<div id="outline-container-org0563b23" class="outline-3">
<h3 id="org0563b23">Brace expansion</h3>
<div class="outline-text-3" id="text-org0563b23">
<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> /home/*


</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> {/home/*,/mnt/*}/.*profile


</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">
  <span style="font-weight: bold;">echo</span> {d..a}

<span style="font-weight: bold;">echo</span> {10..0}

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
